import action1 from '../assets/images/mocks/action-thumb-1.jpg'
import action2 from '../assets/images/mocks/action-thumb-2.jpg'
import action3 from '../assets/images/mocks/action-thumb-3.jpg'
import actionBanner1 from '../assets/images/mocks/action-banner-1.jpg'

const actions = [
  {
    id: 30420,
    thumb: action1,
    banner: actionBanner1,
    title: 'Новинка — Піца «Сициліо»',
    period: 'з 22.08 по 29.08',
    description: `<p>Пориньте в гастрономічну атмосферу узбережжя Сицилії та спробуйте піцу, приготовану за етнічним рецептом італійських майстрів.</p> 
    <p>Ніжне та пишне тісто у поєднанні з вишуканим томатним соусом, ароматним базиліком та тягучою моцареллою — це піца Сициліо!</p>`,
    slug: 'novynka-pizza-sicilio',
  },
  {
    id: 30421,
    thumb: action2,
    banner: actionBanner1,
    title: 'Новинка — Піца «Баварія»',
    period: 'з 22.08 по 29.08',
    description: `<p>Пориньте в гастрономічну атмосферу узбережжя Сицилії та спробуйте піцу, приготовану за етнічним рецептом італійських майстрів.</p> 
    <p>Ніжне та пишне тісто у поєднанні з вишуканим томатним соусом, ароматним базиліком та тягучою моцареллою — це піца Сициліо!</p>`,
    slug: 'novynka-pizza-bavaria',
  },
  {
    id: 30422,
    thumb: action3,
    banner: actionBanner1,
    title: 'Комбо 1+1',
    period: 'з 22.08 по 29.08',
    description: `<p>Пориньте в гастрономічну атмосферу узбережжя Сицилії та спробуйте піцу, приготовану за етнічним рецептом італійських майстрів.</p> 
    <p>Ніжне та пишне тісто у поєднанні з вишуканим томатним соусом, ароматним базиліком та тягучою моцареллою — це піца Сициліо!</p>`,
    slug: 'kombo-1-1',
  },
  {
    id: 30423,
    thumb: action2,
    banner: actionBanner1,
    title: 'Новинка — Піца «Баварія»',
    period: 'з 22.08 по 29.08',
    description: `<p>Пориньте в гастрономічну атмосферу узбережжя Сицилії та спробуйте піцу, приготовану за етнічним рецептом італійських майстрів.</p> 
    <p>Ніжне та пишне тісто у поєднанні з вишуканим томатним соусом, ароматним базиліком та тягучою моцареллою — це піца Сициліо!</p>`,
    slug: 'novynka-pizza-bavaria-2',
  },
  {
    id: 30424,
    thumb: action3,
    banner: actionBanner1,
    title: 'Комбо 1+1',
    period: 'з 22.08 по 29.08',
    description: `<p>Пориньте в гастрономічну атмосферу узбережжя Сицилії та спробуйте піцу, приготовану за етнічним рецептом італійських майстрів.</p> 
    <p>Ніжне та пишне тісто у поєднанні з вишуканим томатним соусом, ароматним базиліком та тягучою моцареллою — це піца Сициліо!</p>`,
    slug: 'kombo-1-2',
  },
  {
    id: 30425,
    thumb: action1,
    banner: actionBanner1,
    title: 'Новинка — Піца «Сициліо»',
    period: 'з 22.08 по 29.08',
    description: `<p>Пориньте в гастрономічну атмосферу узбережжя Сицилії та спробуйте піцу, приготовану за етнічним рецептом італійських майстрів.</p> 
    <p>Ніжне та пишне тісто у поєднанні з вишуканим томатним соусом, ароматним базиліком та тягучою моцареллою — це піца Сициліо!</p>`,
    slug: 'novynka-pizza-sicilio-2',
  },
]

export default actions
